# .zsh_plugins.txt - comments begin with "#"

# Python environment management
matthiasha/zsh-uv-env

getantidote/use-omz        # handle OMZ dependencies
ohmyzsh/ohmyzsh path:lib   # load OMZ's library
# load OMZ plugins
ohmyzsh/ohmyzsh path:plugins/command-not-found
ohmyzsh/ohmyzsh path:plugins/fzf

zsh-users/zsh-syntax-highlighting
zsh-users/zsh-completions kind:fpath path:src
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search
